import type { Music } from "~/types";
import { getPerson } from "../../persons";

export const kokonisaku: Music = {
  type: "music",
  id: "kokonisaku",
  title: "ここに咲く",
  description: `
小春六花の「卒業」をテーマにして制作した楽曲です。
激しめスリーピースガールズバンドサウンド
`,
  tags: ["バンドサウンド"],
  credits: [
    {
      ...getPerson("竹馬あお"),
      role: "作詞、作曲、編曲",
    },
    {
      name: "小春六花",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2026-11-01"),
  lyrics: `
目を瞑る、息を吸う、駆け上がる、光が芽吹く機運
繰り返す、繰り返す季節、巡るたび零れ落ちた
ぼくらの朝、限りなく解像度の高い夢を見た気がした
どこに咲く、どこに咲く、願いの種を見失いそうだった
逃げ回る、差し迫る、限りある、光の差す範囲でただ
繰り返す、繰り返す、繰り返す季節、巡る、またここを選ぶ
朝が来て、大好きなあなたたちさえ旅人だったと知っても
ここに咲く、ここに咲く、ここに咲く！

答えはさ
難解だった？
抗ってさ
ようやく知った。

満開、この感情が
無視できないほど乱反射した！
愛した運命に
ハロー・アゲイン、
ハロー・ワールド
満開、またループした
根を張って、またループした！
相対した日常に
ハロー・アゲイン、
ハロー・メリー・ワールド

（繰り返す、繰り返す、繰り返す）
（ここに咲く、ここに咲く、ここに咲く）

決別はさ
簡単だった？
抗ってさ
ようやく知った。

満開、この感情が
無視できないほど乱反射した！
愛した運命に
ハロー・アゲイン、
ハロー・ワールド
満開、またループした
根を張って、またループした！
相対した日常に
ハロー・アゲイン、
ハロー・メリー・ワールド

（繰り返す、繰り返す、繰り返す）
（ここに咲く、ここに咲く、ここに咲く）
`,
};
