import type { Music } from "~/types";
import { getPerson } from "../../persons";

export const matte: Music = {
  type: "music",
  id: "matte",
  title: "待って！",
  description: `
イラスト合同誌兼音楽コンピ『天馬手毬四季合同』に書き下ろした楽曲です。
天馬手毬×春をイメージしたわちゃわちゃとしたポップス
`,
  tags: ["バンドサウンド", "コンピ参加作品"],
  credits: [
    {
      ...getPerson("竹馬あお"),
      role: "作詞、作曲、編曲",
    },
    {
      name: "天馬手毬",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2026-09-13"),
  links: [
    {
      platform: "twitter",
      url: "https://x.com/neineinenene/status/2096168963281424652",
    },
  ],
  lyrics: `
待って！！

こんがらがらった！ばらさよ季節
問題だらけ？あたふたラナウェイ
踏切前3回転まわって停滞？じれったい？もう助けて！

三寒四温って取り出した半袖
どっちでもきみは気にしちゃいないね
36度鈍いもういいって、昼下がり、春、健闘中

試験管Aからあふれる桃色のB
（代入して）ここにいる
（応答して）ちゃんと見て
目が合えば芽吹くストーリー

あのね！まるでダメダメ
触れられなくたって期待していいよね？
果報はうたたねしてないで！
ほの甘い本音、歩幅をちょっと小さくして聞いてなんて
いつか隠しきれなくなるから
でも今日くらい涼しいのがいいから

待って！！

こんがらがらった！理想と現実
問題だらけ？ノックしてフォースウォール
満開今がチャンス・はいかYESが確定！？つかまえて、離さないで

心機一転ってしてみたアレンジ
どっちでもきみは気にしちゃいないね
結局ツー・ファイブ・ワンな足踏みでぐるぐる、春、停滞中

（安定解・決定論・満足してない？）
ってかどうしよう！？
（あと数センチの待ち読みとかもったいない！）
ってかどうしたい！？
（記憶の中のきみのほんとの「好き」手に入れたい！）
ってかどうやって目が合って始まる、ストーリー

あのね！まるでダメダメ
触れられなくたって期待していいよね？
果報はうたたねしてないで！
ほの甘い本音、歩幅をちょっと小さくして聞いてI say
「いつか消えてなくなっちゃうなら、きみの手だけ繋いでたいな」
って、聞いてる？？

待って！！
`,
};
