import type { Music } from "~/types";
import { getPerson } from "../../persons";

export const sukuenakatta: Music = {
  type: "music",
  id: "sukuenakatta",
  title: "掬えなかった星たちを数えてる",
  description: `
夏色花梨の「卒業」をテーマにして制作した楽曲です。
こういう星空をイメージしたロックポップスが好きです。
`,
  tags: ["バンドサウンド"],
  credits: [
    {
      ...getPerson("竹馬あお"),
      role: "作詞、作曲、編曲",
    },
    {
      name: "夏色花梨",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2026-11-01"),
  lyrics: `
星・光・指先・街・灯・瞬き・刹那と空白
翼を失くして何処へ何処へ何処へ翔び立つのか

小さかった冒険
アンプで誤魔化す
つま先が逸る
鳴らせば鳴らすほど掻き消せない鼓動

掬えなかった歪の数々が
星ひとつない夜に歩く足を止めさせる
響かせた！

手放すにはもう遅すぎた
愛おしい、愛おしい！
今から過去になっていくんだ
焦がれるには幼すぎた
それでも未来は残酷にあなたからわたしを奪い取っていく
憧れのふたつくらい咲かせられたかな？
タイムリミットまであとちょっと

大きく育った偏愛
笑顔で誤魔化す
指先は動く
鳴らせば鳴らすほど掻き消せない鼓動、
前なんか見ないで、
ずっとこのままでいたい、
ずっとこのままでいたい、
ずっとこのままでいたい、

掬えなかった星を数えていた
書きなぐったバンドスコア
あなたの記憶でインクが滲んだ
そうだ、夢みたいな満天ステージ
あの日あなたは何を祈った？
世界は余白を残して同じ風を吹かせるんだ
「全部」になりたい、「全部」になれない
器用な言葉なんて最初からなかった。

響かせた！

手放すにはもう遅すぎた
愛おしい、愛おしい！
今から過去になっていくんだ
焦がれるには幼すぎた
それでも音楽は残酷にあなたをわたしに刻み込む
憧れのふたつくらい咲かせられたかな？
朝が来るまであとちょっと
`,
};
