import type { Music } from "~/types";

export const asatte: Music = {
  type: "music",
  id: "asatte",
  title: "あさっての蒼穹まで",
  description: `
マジカルミライ2020楽曲コンテスト応募作です。
伝えたい想いを言葉にして、
その言葉を歌詞に書き出して、
できた詩を虹のはしっこに載せて、
想いを載せた虹が蒼穹をかけるのを見つめてる。
そんな感じの和風ロックです。
`,
  tags: [], // TODO
  credits: [
    {
      name: "閔仲 (later 竹馬あお)",
      role: "作詞、作曲、編曲",
    },
    {
      name: "初音ミク",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2020-01-20"),
  links: [
    {
      platform: "piapro",
      url: "https://piapro.jp/content/mjoc4ifn6ekp3qgp",
    },
  ],
  video: {
    credits: [
      {
        name: "竹馬あお",
        role: "映像制作",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=tKNMMPglKxk",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm41903690",
    bilibiliUrl: "https://www.bilibili.com/video/BV1HT411a7MK",
  },
  lyrics: `
此の詩よ、あさっての蒼穹まで

無聊の徒然に　「夢はわからない」と嘆く君
くじけそうに涙ぐむ　「僕はできない」と慄く君
流転の隙を踏み分けて　「光は何処？」と惑う君
手を取っていっしょに飛ばないか　何をか憂えん

ほら、掴みたい奇蹟は？
ほら、叫びたい想いは？
ほら、綴りたい未来は？
さあ、みな詩にして。虹に載せて。

往け！
僕と君の届けたい詩よ
今言の葉が梢より舞い上がって
あしたの蒼穹まで、
いや、あしたさえも飛び越えてあさってまで

闇路から君に救われ　「歌うこと」を知った僕
多感な君と語らいて　「感情」なるものを覚えた僕
その感情が在り溢れて　「ありがとう」と呟く僕
手を繋いでいっしょに飛ばないか　何をか長雨（ながめ）ん

届け！
君と僕の言葉載せた虹よ
もっと、もっと、もっと高い所へ
青空のどっかで旅するといいな。
其の旅がずっと続くといいな。

此の四分間（うた）よ、あさっての蒼穹まで
「届くといいな？」
いや、きっと届くんだ、僕らの手で届けるんだ

往こう！
僕と君が目指すみらいまで
また言の葉が梢より舞い上がって
未来（あした）の蒼穹まで、
いや、未来（あした）さえも飛び越えて遠未来（あさって）まで

手を繋いで、みらいの蒼穹まで
`,
};
