import type { Music } from "~/types";

export const itomagoi: Music = {
  type: "music",
  id: "itomagoi",
  title: "いとまごい",
  description: "高校生という傘を仕舞って、雨が止んだら何者でもない",
  tags: [], // TODO
  credits: [
    {
      name: "閔仲 (later 竹馬あお)",
      role: "作詞、作曲、編曲",
    },
    {
      name: "初音ミク",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2020-05-05"),
  video: {
    credits: [
      {
        name: "閔仲 (later 竹馬あお)",
        role: "映像制作",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=RA04ALsRj_k",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm36806374",
    bilibiliUrl: "https://www.bilibili.com/video/BV1oe411s75d",
  },
  lyrics: `
校舎裏の樹が彩る前に　「大人」になってやると誓ったのに
この制服を脱ぎ捨てる前に　生きる意味を見つけると言ったのに
鴫が梢に帰って来るまでに　やりきったなと自分に伝えたいのに
十八歳になるまでに　自立しようと語っていたのに

ただただ　美しかった
ひらひら　舞う様だった
青い春とか謂う光陰は
水に揺蕩う儘流れていった

ひたすら　奔り抜けた
きらきら　眩しかった
夢とは言わない、全部現実だから
でも何時か覚める気はしていた

何が辛くて　何が欲しくて
どうして息苦しくなったんだろう
此処にいていい？何処にいたらいい？
悩む間も残り少なくなった

高校生という傘を仕舞って
雨が止んだら何者でもない
僕は、僕は、されど歩くんだ
せめて傘の下で囁かせて、僕のいとまごい

ただただ　幸せだった
ぷかぷか　浮かんでいた
周りから何もかも貰いすぎて
出世払いなんて都合よすぎた

ひたすら　恋に落ちた
ゆらゆら　心動いた
絶えなば絶えね、なんか
幾千回も脳裡を過った
　
「何を愛して　何が恋しくて
どうして未だ息をしているんだろう
でも好いや、答えは解らないけれど」
と先送りも此処で終わりかな

高校生という名を降ろして
「若いなあ」を言う側になって
僕は、僕は、されど謳うんだ
でも今は弱音を吐かせて、僕のいとまごい

あの六畳間の灯りを消して
鍵を返せばもう何者でもない
僕は、斯うして、大人に成るのに
なぜあの夜涙が止まらなかったんだ？

未成年という傘を捨てて
水溜りもリスクも律儀に避けて
僕は、僕は、されど好きなんだ
旅立つ僕達も、愛してくれた世界も。

高校生という傘を仕舞って
雨が止んだら何者でもない
僕は、僕は、されど歩くんだ
せめて傘の下で囁かせて、僕のいとまごい
`,
};
