import type { Music } from "~/types";

export const kaigansen: Music = {
  type: "music",
  id: "kaigansen",
  title: "夏の海岸線では聴こえない。",
  description: "少し切ない夏の歌です。",
  tags: [], // TODO
  credits: [
    {
      name: "閔仲 (later 竹馬あお)",
      role: "作詞、作曲、編曲",
    },
    {
      name: "紲星あかり",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2020-04-27"),
  video: {
    credits: [
      {
        name: "閔仲 (later 竹馬あお)",
        role: "映像制作",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=l459VgjWMto",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm36755275",
    bilibiliUrl: "https://www.bilibili.com/video/BV1cQ4y1N7gC",
  },
  lyrics: `
随分遠くまで歩いたね、紺碧が紅掛かるまで。
ううん、疲れてない、と君は振り向かずに石を蹴った。
ちょっと休憩しよう、と海の聴こえるここで腰掛けた。
どこまで話したっけ、と問うと君は、やっぱり泣いていた。

颯と潮風が凪いだ。君も落ち着いたみたいだ。
率と視線を見上げた。視界の限り2792c3とf19072(にしょく)になった。
この海の先は見えますか、海の先の音聞こえますか。
溌と気付いたあの日から、その音は僕を止めないだろうなあ。

現実と想像の境界上、なぞって波間が遠のいた。
限りを知ったのに、一層現実が美しいから。
また桜が咲く季節に、僕はここを去ろうと思うんだ。
だから、今は。

止めないで、阻まないで、
って君には言わないから。
触れさせて、収めさせて。
向こう側に続く未知を。
夢だって、空想だなんて、
君はきっと謂わないんだな。
でも、波に霞んだ前の景色をこの胸に射止めたいだけなんだ。

向こうに行ってみたい、と呟くといつも揶揄われた。
埋もれるぞ、危ないぞと大人はイツモヤサシクミチヲシイテクレタ。
個性(ひと)と個性(ひと)が犇めき合う、あの街で息を潜める。
そういう現実がいいんだ、この町で個性(ぼく)を潜めるより。

そろそろ歩こうか、と僕は立ち、砂を払った。
「君と歩いた町の空には。思い出が溶け込んでるんだ。だから、私は、」
震える君の声は止まった。
波の音も、どっかの風鈴の音も、

止めないで、阻まないで、
いつか証明してみせるよ。
触れさせて、収めさせて。
海岸線に落ちていない未知を。
夏にはさ、此処に戻るから、
一緒にこの渚を歩こうよ。
紅から群青に変わるまで、
溶解(とけ)た星空を一緒に見るから。
`,
};
