import type { Music } from "~/types";

export const late_november: Music = {
  type: "music",
  id: "late_november",
  title: "11月下旬",
  description: "分類不可能の単数形",
  tags: [], // TODO
  credits: [
    {
      name: "閔仲 (later 竹馬あお)",
      role: "作詞、作曲、編曲",
    },
    {
      name: "紲星あかり",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2020-03-05"),
  video: {
    credits: [
      {
        name: "傘ユウハ",
        role: "イラスト、映像制作",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=SnUbp-oXymw",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm36464998",
    bilibiliUrl: "https://www.bilibili.com/video/BV1iE411W7dC",
  },
  lyrics: `
嗚呼、寒いな　街路は黄色、11月下旬
いつもは自転車なんだが　今日は鞄からICOCAを出した
密閉された匣の中　ただ人混みは冷たかった
「大人」で身を囲んで思った、「これで大人になれるかな」

六時五十分の白い吐息　310Kはただぬるいだけ
深い不快いぬるま湯の中　零す藍もない僕はまだ

分類不可能の不安定を　どうも愉しめない単数形
蛹の儘の僕を置いて　二原子分子で満たす化学的安定
居るだけで景観壊すから　古都京都では罰金かい？
秋風の寒さを知って　僕は何処にも行けないや

嗚呼、寒いな　ラテマネー増えがち、11月下旬
来月はクリスマスか　それでリア充が増えたもんだな
一瞬羨望する僕には　群青に近寄る資格もないんだ
先へと進む航路は　赤信号の儘なんだ

十八歳ってこんなものか？　大人ってこんなんじゃないし
『高校生』というアルバムがあっても　僕はどうせ収録されないんだ

分類不可能の単数形　居場所を願うなんて欲望さ
未来の自分は今の儘　大人になれぬままだらだら過ごすのか
居るだけで酸素が減るから　平均点を下げるから
なんで君も君たちもだれもかれも　僕を生かさず殺さずどうしたいんだ

分類不可能の単数形　悩みに悩んだ終着点は
森の中に取り残された　滝を勝手に背負った自称修行者
居なければ酸素も足りるのに　消費した分ちゃんと返すから
誰か僕を通して　それで師走に進めるんだ
`,
};
