import type { Music } from "~/types";

export const mataao: Music = {
  type: "music",
  id: "mataao",
  title: "また青い春が来る",
  description: `
アルバム『縋想』を締めくくる、来たる春に祈る楽曲。
`,
  tags: [], // TODO
  credits: [
    {
      name: "竹馬あお",
      role: "作曲、編曲",
    },
    {
      name: "佐薙概念",
      role: "作詞",
    },
    {
      name: "可不",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2021-12-18"),
  video: {
    credits: [
      {
        name: "竹馬あお",
        role: "映像制作",
      },
      {
        name: "犬吠埼いつき",
        role: "イラスト",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=HiPtapTHyCE",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm39771644",
    bilibiliUrl: "https://www.bilibili.com/video/BV1qq4y127GC",
  },
  lyrics: `
ぜんぶ僕の所為なのに　勝手に辛くなってごめんね
息が白んでいた　18回目の冬が来た
キミはもう覚えてないだろうな　贖罪なんて自己満足だ
 
幸せを知らなければ　不幸を知らなかった
悲劇ばかりの人間は　喜劇なんて想像もできないから
だったら僕はいっそ、不幸のままでいいさ

夢から覚めて毒虫になっていても　怯えてもらえたならよかった
グレゴール、彼は幸せだったんだな

冬の空気で痛む喉が　歌を歌おうとまた声を上げる
どこかで幸せなあのキミに　捧げるこの祈り　届かなくていい 
冬の所為で今年も死ねなかった　人生なんていらないさ

架空の感傷、消えないでいる

キミは望んでなどないのに　勝手に縋りついてごめんね
大人になった　大切な人が出来た
喉に刺さった小骨　抜けずに死んだように生きる

愛を知らなければ　罪を知らなかった
どうせ嫌われるなら最初から愛さないから

壁の影絵が幻だったとしても　美しければ何でもよかった
ウェルテル、彼は幸せだったんだな

僕に殺されたあの夏が　 僕を殺そうと近づいている
ぜんぶ嫌いになれないこの僕に　幸せな未来　望めなくていい
キミの所為であの時生きられなかった　将来なんていらないさ 

影が伸びる自販機　人の為なんて偽りだし
防波堤のラムネ　信じるなんて嘘じゃないか
夕日差す音楽室　この人生は仮定だ
玄い冬も終わるみたいだ。また青い春が来る。

春の陽気で溶ける輪郭　時空がゆがんでまたキミに会える
今も醒めないこの夢に　捧げるこの祈り　届いてくれよ
桜吹雪にまた後ろ姿が見える　現実なんていらないさ

偽物の記憶、傷ついている。

この想い出に、縋っている。

縋想。
`,
};
