import type { Music } from "~/types";

export const natsuno_owari: Music = {
  type: "music",
  id: "natsuno_owari",
  title: "夏の終わり、物語の続き",
  description: "君と共に送った夏を",
  tags: ["夏", "バンドサウンド"],
  credits: [
    {
      name: "閔仲 (later 竹馬あお)",
      role: "作詞、作曲、編曲",
    },
    {
      name: "紲星あかり",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2019-08-30"),
  video: {
    credits: [
      {
        name: "閔仲 (later 竹馬あお)",
        role: "映像制作",
      },
      {
        name: "じょうさくら",
        role: "イラスト",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=1yAXIxIuKMw",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm36293162",
    bilibiliUrl: "https://www.bilibili.com/video/BV1qE411W71k",
  },
  lyrics: `
最後の。を書き終えた一瞬
この世界を詰め込めたと思った
蒼くて 透き通って 果のない
夏空のような青春を

駒込ピペットを虚空に向けて
ゆっくりと指を緩める
今年こそ手放したくない
消えちゃいそうな青を 君の笑顔を
「物語の書き手は僕らなんだ。」
 
嗚呼
君との時間を繋ぎ止めたくて
君との想い出を忘却れたくなくて
移りゆく日常の中で
僕等の物語だけ色褪せないで

ねぇ
蝉の音さえも霞んで仕舞う程
夏の終りさえ引留められる程
まだ拙くても良いから
君の声を貸してくれませんか

最初の「を書き込んだ時から
この物語は完璧でないと知った
怖くて 急ぎ足で ただ愛おしい
夏空をどう紡いだらいいだろうか

登ってく、登ってく、登ってく日常は
綴ってく、綴ってく、続いてく世界は
あまりにも、眩しく、儚く、ありがたいと、
ただ、思うしかなかった。

嗚呼
君との時間を繋ぎ止めたくて
君との想い出を忘却れたくなくて
移りゆく世界の中で
僕等の物語だけ永遠に伝えて

ねぇ
花火のように覚束なく
きっと僕らの夏は終わって仕舞うけど
だからこそ書き続けるんだ
青春後半戦の前書を

登ってく、登ってく、登ってく日常は
綴ってく、綴ってく、続いてく世界は
褪せてく、忘れてく、移ろってく、運命の
本の一部にすぎないのか
違うって言って。

ねぇ
君との時間を繋ぎ止めたくて
君との想い出を忘却れたくなくて
移りゆく日常の中で
僕等の物語だけ色褪せないで

ねぇ
君と共に送った夏をーー

眩しく、儚い、物語を紡いでって
`,
};
