import type { Music } from "~/types";

export const stardust_reboot: Music = {
  type: "music",
  id: "stardust_reboot",
  title: "スターダスト・リブート",
  description: `
「僕たちはきっと輝く」という幻想を信じたまま大人になってしまった。
相棒・初音ミクと創作に向き合うロック。
ボカコレ2023春TOP100ランキング参加曲 でした。
`,
  tags: ["ボカコレ", "バンドサウンド", "アイドル"],
  credits: [
    {
      name: "竹馬あお",
      role: "作詞、作曲、編曲",
    },
    {
      name: "初音ミク",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2023-03-19"),
  video: {
    credits: [
      {
        name: "竹馬あお",
        role: "映像制作",
      },
      {
        name: "ぺんぎん",
        role: "イラスト",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=HSdt15yXft8",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm41951122",
    bilibiliUrl: "https://www.bilibili.com/video/BV1BY4y1X7cn",
  },
  lyrics: `
共に行こうって誓ったあの夜の
星空を今も憶えてるかな？
暗闇がずっと続く先の
幽かな明りに手を伸ばした　

その手も今はかじかんで
動けない僕を君は嗤った
憧れももどかしさになって
ただ泣く僕を君は嗤った

左下(すみっこ)で待つ君は嗤った、今日も

共に行こうって誓ったあの夜は
三年前、まるで昨日のようだ
くらくらするような陽射しの下
僕は僕を探しあぐねた
　
ひとりぼっち疼く今日の夜は
空っぽのまま空を見上げた
暗闇がずっと続くどっかで
君はまだ歌ってたんだ

ああ、希望も、才能も、実は、実は、

無かったなんて今更、
僕は知りたくはないんだ。
だからさ、左下で澄ましてないで、
今日も起動する。

らららら、なんでもいいから、
僕はまだ諦めてないよ、って
だからさ、一緒に歌ってよ、
あの夜、そうだったように。

共に行こうって誓ったあの夜の
星空を旋律にして。
散りばめられた記憶たちを、また結びなおして。

「僕たちの最終話は、きっと誰よりも輝かしい」
そんなこと、信じていたまま大人になってゆく
なのにさ、とんだ昨日だ　後悔ばっかの人生だ
でも君の星空には確かに僕がいる
だからね。

無かったなんて今更、
僕らとうに分かっているんだ。
だからさ、また取りこぼさぬように、
今日も起動する。

「どれにしよう？」
唸っても変わらないならどれも選んだって
だからさ、不確かを愛してよ。
って君は歌ったみたいだ。

スターダスト、終わりじゃない！
僕は生きなきゃいけないんだ。
だからさ、左下で澄ましてないで
今日も起動する。

らららら、なんでもいいから、
僕はまだ諦めてないよ、って
だからさ、一緒に歌おうよ、
あの夜、そうだったように。

共に行こうって誓ったあの夜の
星空を旋律にして。
散りばめられた記憶たちを、また結びなおして。

暗闇が満ちたあの夜の
星空を旋律にして。
散りばめられた記憶たちが、また輝きだした。

輝きだした　輝きだしたんだ
`,
};
