import type { Music } from "~/types";

export const svm: Music = {
  type: "music",
  id: "svm",
  title: "サマー・ヴァーチャル・マシン",
  description: `
夏・感傷マゾ・オルタナティブロック。
題名は support-vector machine の略称 SVM から。
`,
  tags: ["夏", "バンドサウンド"],
  credits: [
    {
      name: "竹馬あお",
      role: "作詞、作曲、編曲",
    },
    {
      name: "初音ミク",
      role: "ボーカル",
    },
    {
      name: "VOICEVOX ナースロボ＿タイプＴ",
      role: "ポエトリーリーディング",
    },
  ],
  releaseDate: new Date("2024-04-28"),
  lyrics: `
28度で固定された夏の、
乾ききった無音の四畳半、
シーリングライトに向かって何度も、
やり場無い沈痛を表した。

堆く積まれた問題は、
青の逆位相を成す集合体、
境界から今日も一歩も踏み出せず、
ただ通り雨の過ぎるを待った。

28度で固定された夏の、
次の夏もまたその次の夏も、
仮想を小さな世界で回して、
仮想の中で充足を得て、

「ラムネ、花火、浴衣、海、
清冽な、純粋な、かけがえのない、想い出、」
未整理のそれら空っぽな響きたちが、
手のひらから落ちてゆくんだ。

退屈な、やけに凡庸な、号びも茫くて、ゆらり、ゆらり、[空]を描いた
虚構が、なまじ痛くて、それでも居たくて、emulate、emulate、空を描いたんだ。
「私はここにいない」「私の居場所じゃない」痛みを伴う拒絶反応、無記憶の定常
退屈な、やけに凡庸な、乾いた、渇いた、無機質な夏だ、真っ白の夏だ。

28度で固定された夏の、
乾ききった無音の四畳半、
シーリングライトに向かって、
叫んだ、叫んだ。

夏だけが特別に思えた、
縋っていたい「何か」が見えた、
でもただただ想ってただけな、
私はどこにも行けなかった。

28度で固定された夏の、
片隅で泣くふりでもして、
散り散りのアイデンティティを、
満たした、満たした。

言葉に絆され意味に排され、
縋っていたい「君」もなかった、
でもただただ感傷ってただけな、
私は一体ドコデマチガエタ？

退屈な、やけに凡庸な、号びも虚しくて、ゆらり、ゆらり、空を描いた
現実も、なまじ痛くて、だから逃げちゃって、emulate、emulate、[空]を描いたんだ。
「君はここにいない」「君はどこにもいない」痛みを伴う成績開示、未定義の操作
退屈な、やけに凡庸な、焦がれた、焦がれた、どこにもない夏、まっさらの夏だ。
`,
};
