import type { Music } from "~/types";

export const ubugoe_song: Music = {
  type: "music",
  id: "ubugoe_song",
  title: "産声",
  description: `
滲んでゆく君の記憶が苦しい。
アルバム『産声、滲んだきみの青』表題曲。バラードです。
無色透名祭Ⅱ投稿曲でした。
`,
  tags: ["バラード", "バンドサウンド"],
  credits: [
    {
      name: "竹馬あお",
      role: "作詞、作曲、編曲",
    },
    {
      name: "花隈千冬",
      role: "ボーカル",
    },
  ],
  releaseDate: new Date("2023-11-02"),
  video: {
    credits: [
      {
        name: "竹馬あお",
        role: "映像制作",
      },
      {
        name: "こんぺき",
        role: "イラスト",
      },
    ],
    youtubeUrl: "https://www.youtube.com/watch?v=ky9xVgVDwvI",
    niconicoUrl: "https://www.nicovideo.jp/watch/sm44105157",
    bilibiliUrl: "https://www.bilibili.com/video/BV14342eKE1H",
  },
  lyrics: `
心臓が融けて、流れた言葉と戻らない感情、
すべて失って、ようやく僕は産声を、上げる。

暈けてゆく夕暮れ、自転車の音、
夜九時、帰り道、君の声紋、
溶けてゆく世界と、かつて鮮明だった、感情、僕だけ、置いてかれた。
滲んでゆくペトリコール、生きる理由、
僕の罪業と、君の温もり、
溶けてゆく記憶と、残滓ばかり澱んだ、心臓、僕だけ、老いて枯れた。

「孤独の痛みを捧げて償えたら」
そんな優しい世界こそ在りもしないユートピア。
産まれ持った間違いが少しずつ少しずつ深い溝にこびり付いた。

心臓が融けて、消えた祈りと届かない本音、
すべて終わって、ようやく僕は産声を、上げた。
苦しい、苦しい、苦しい！
愛した、愛して、傷つけた証明も、
剝れる、剝れる、剝れる、剝れて、僕は何が残るんだろう？

どこにもいけないまま君の輪郭に縋った、
三年前からちょっとは僕もオトナになれたかな。
君の色した世界が狂うほど恋しいや。
痛いほどの無色を、消せない透明を、救済って。

心臓が融けて、流れた言葉と戻らない感情、
すべて失って、ようやく僕は産声を。
記憶が溶けて、消えた祈りと届かない本音、
すべて終わって、ようやく僕は産声を、上げた。
苦しい、苦しい、苦しい！
愛して、愛してとねだった罪状も、
忘れる、忘れる、忘れる、忘れて、僕は何に縋るんだろう？
`,
};
